(LOOP)
  @KBD
  D=M

  // None (0)
  @LOOP
  D;JEQ 

  @130
  D=D-A // Значение от 0 до 3

  // LEFT (130)
  @LEFT
  D;JEQ

  // UP (131)
  @UP
  D=D-1
  D;JEQ

  // RIGHT (132)
  @RIGHT
  D=D-1
  D;JEQ

  // DOWN (133)
  @DOWN
  D=D-1
  D;JEQ

  @LOOP
  0;JMP


// Начало для LEFT
(LEFT)
  @SCREEN
  D=A

  @3978
  D=D+A

  @SMILE
  0;JMP


// Начало для UP
(UP)
  @SCREEN
  D=A

  @2640
  D=D+A

  @SMILE
  0;JMP


// Начало для RIGHT
(RIGHT)
  @SCREEN
  D=A

  @3989
  D=D+A

  @SMILE
  0;JMP


// Начало для DOWN
(DOWN)
  @SCREEN
  D=A

  @5296
  D=D+A

  @SMILE
  0;JMP


(SMILE)
  // Определение начала
  @0
  M=D


  // Строка №1
  // ---- Запись строки ----
  @7224
  D=A

  @0 // n+32*0
  A=M
  M=D
  // -----------------------



  // Строка №2
  // ---- Переход на новую строку ----
  @32
  D=A

  @0
  M=M+D
  // ---------------------------------

  // ---- Запись строки ----
  @7224
  D=A

  @0 // n+32*1
  A=M
  M=D
  // -----------------------



  // Строка №3
  // ----- Переход на новую строку -----
  @32
  D=A

  @0
  M=M+D
  // -----------------------------------

  // ---- Запись строки ----
  @7224
  D=A

  @0 // n+32*2
  A=M
  M=D
  // -----------------------



  // Строка №4
  // ----- Переход на новую строку -----
  @32
  D=A

  @0
  M=M+D
  // -----------------------------------



  // Строка №5
  // ----- Переход на новую строку -----
  @32
  D=A

  @0
  M=M+D
  // -----------------------------------



  // Строка №6
  // ----- Переход на новую строку -----
  @32
  D=A

  @0
  M=M+D
  // -----------------------------------

  // ---- Запись строки ----
  @24582
  D=A

  @0 // n+32*5
  A=M
  M=D
  // -----------------------



  // Строка №7
  // ----- Переход на новую строку -----
  @32
  D=A

  @0
  M=M+D
  // -----------------------------------

  // ---- Запись строки ----
  @14364
  D=A

  @0 // n+32*6
  A=M
  M=D
  // -----------------------



  // Строка №8
  // ----- Переход на новую строку -----
  @32
  D=A

  @0
  M=M+D
  // -----------------------------------

  // ---- Запись строки ----
  @4080
  D=A

  @0 // n+32*7
  A=M
  M=D
  // -----------------------

  
  @CONTINUE
  0;JMP


(CONTINUE)
  // LEFT
  (CONTINUE_LEFT)
    @KBD
    D=M

    @130
    D=D-A

    @CONTINUE_LEFT
    D;JEQ

  @0
  D=M

  @20586
  D=D-A

  @CLEAR_LEFT
  D;JEQ


  // UP
  (CONTINUE_UP)
    @KBD
    D=M

    @131
    D=D-A

    @CONTINUE_UP
    D;JEQ

  @0
  D=M

  @19248
  D=D-A

  @CLEAR_UP
  D;JEQ


  // RIGHT
  (CONTINUE_RIGHT)
    @KBD
    D=M

    @132
    D=D-A

    @CONTINUE_RIGHT
    D;JEQ

  @0
  D=M

  @20597
  D=D-A

  @CLEAR_RIGHT
  D;JEQ


  // DOWN
  (CONTINUE_DOWN)
    @KBD
    D=M

    @133
    D=D-A

    @CONTINUE_DOWN
    D;JEQ

  @0
  D=M

  @21904
  D=D-A

  @CLEAR_DOWN
  D;JEQ



// Начало для LEFT
(CLEAR_LEFT)
  @SCREEN
  D=A

  @3978
  D=D+A

  @CLEAR
  0;JMP


// Начало для UP
(CLEAR_UP)
  @SCREEN
  D=A

  @2640
  D=D+A

  @CLEAR
  0;JMP


// Начало для RIGHT
(CLEAR_RIGHT)
  @SCREEN
  D=A

  @3989
  D=D+A

  @CLEAR
  0;JMP


// Начало для DOWN
(CLEAR_DOWN)
  @SCREEN
  D=A

  @5296
  D=D+A

  @CLEAR
  0;JMP


// Стирание
(CLEAR)
  // Определение начала
  @0
  M=D


  // Строка №1
  // ---- Запись строки ----
  @0
  D=A

  @0 // n+32*0
  A=M
  M=D
  // -----------------------



  // Строка №2
  // ---- Переход на новую строку ----
  @32
  D=A

  @0
  M=M+D
  // ---------------------------------

  // ---- Запись строки ----
  @0
  D=A

  @0 // n+32*1
  A=M
  M=D
  // -----------------------



  // Строка №3
  // ----- Переход на новую строку -----
  @32
  D=A

  @0
  M=M+D
  // -----------------------------------

  // ---- Запись строки ----
  @0
  D=A

  @0 // n+32*2
  A=M
  M=D
  // -----------------------



  // Строка №4
  // ----- Переход на новую строку -----
  @32
  D=A

  @0
  M=M+D
  // -----------------------------------



  // Строка №5
  // ----- Переход на новую строку -----
  @32
  D=A

  @0
  M=M+D
  // -----------------------------------



  // Строка №6
  // ----- Переход на новую строку -----
  @32
  D=A

  @0
  M=M+D
  // -----------------------------------

  // ---- Запись строки ----
  @0
  D=A

  @0 // n+32*5
  A=M
  M=D
  // -----------------------



  // Строка №7
  // ----- Переход на новую строку -----
  @32
  D=A

  @0
  M=M+D
  // -----------------------------------

  // ---- Запись строки ----
  @0
  D=A

  @0 // n+32*6
  A=M
  M=D
  // -----------------------



  // Строка №8
  // ----- Переход на новую строку -----
  @32
  D=A

  @0
  M=M+D
  // -----------------------------------

  // ---- Запись строки ----
  @0
  D=A

  @0 // n+32*7
  A=M
  M=D
  // -----------------------


  @LOOP
  0;JMP